# -*- coding: UTF-8 -*-

class ServerNameMap():
    operateIdToNameMap = {
        # 1000 数据预处理
        "1001": "过滤",
        "1002": "排序",
        "1003": "列拆分",
        "1004": "行拆分",
        "1005": "列合并",
        "1006": "替换",
        "1007": "填充控制",
        "1008": "列变换",
        # 2000 特征工程
        "2001": "分位数离散化",
        "2002": "向量索引转换",
        "2003": "标准化",
        "2004": "PCA",
        "2005": "字符串转标签",
        "2006": "独热编码",
        "2007": "多项式扩展",
        "2008": "卡方选择"
    }
    operateIdToTypeMap = {
        # 1000 数据预处理
        "1001": "数据预处理",
        "1002": "数据预处理",
        "1003": "数据预处理",
        "1004": "数据预处理",
        "1005": "数据预处理",
        "1006": "数据预处理",
        "1007": "数据预处理",
        "1008": "数据预处理",
        # 2000 特征工程
        "2001": "特征工程",
        "2002": "特征工程",
        "2003": "特征工程",
        "2004": "特征工程",
        "2005": "特征工程",
        "2006": "特征工程",
        "2007": "特征工程",
        "2008": "特征工程"
    }

    typeToColorMap = {
        "数据预处理": '#5fe0a6',
        "特征工程": '#f0bb66'
    }